Revit 2024 API
ImportInstance.Create Method
Overload List
Name | Description
Create(Document, ElementId, View)
 Creates a new instance of an existing DWG link type.
Create(Document, View, ExternalResourceReference, DGNImportOptions, LinkLoadResult)
 Creates a new instance of DGN link type from an external resource reference and loads the linked file.
Create(Document, View, ExternalResourceReference, DWGImportOptions, LinkLoadResult)
 Creates a new instance of DWG link type from an external resource reference and loads the linked file.
Create(Document, View, ExternalResourceReference, ImportOptions3DM, LinkLoadResult)
 Creates a new instance of 3DM link type from an external resource reference and loads the linked file.
Create(Document, View, ExternalResourceReference, OBJImportOptions, LinkLoadResult)
 Creates a new instance of OBJ link type from an external resource reference and loads the linked file.
Create(Document, View, ExternalResourceReference, SATImportOptions, LinkLoadResult)
 Creates a new instance of SAT link type from an external resource reference and loads the linked file.
Create(Document, View, ExternalResourceReference, SKPImportOptions, LinkLoadResult)
 Creates a new instance of SKP link type from an external resource reference and loads the linked file.
Create(Document, View, ExternalResourceReference, STLImportOptions, LinkLoadResult)
 Creates a new instance of STL link type from an external resource reference and loads the linked file.
Create(Document, View, String, DWGImportOptions, LinkLoadResult)
 Creates a new instance of DWG or DXF link type from a file path and loads the linked file.
See Also
ImportInstance Class
ImportInstance Members
Autodesk.Revit.DB Namespace